MusicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "CdRugwh6mtFMejyZ0MLiRw"], ["updated_at", "2019-04-04 23:29:59.611435"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = generate_session_token
    self.save!